In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [7]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(100, 'Adler', 'Barrera', 'M', 'free'),
 (61, 'Samuel', 'Gonzalez', 'M', 'free'),
 (55, 'Martin', 'Johnson', 'M', 'free'),
 (37, 'Jordan', 'Hicks', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [8]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOBLGCN12AB0183212', 'James (Hold The Ladder Steady)', 'AR47JEX1187B995D81', 1985, 125)]

In [14]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR47JEX1187B995D81', 'SUE THOMPSON', 'Nevada, MO', 37.8372, -94.3587)]

In [10]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.time(2, 13, 3, 796000), 2, 'Tuesday', 45, 11, 2018, 1),
 (datetime.time(2, 17, 12, 796000), 2, 'Tuesday', 45, 11, 2018, 1),
 (datetime.time(3, 14, 8, 796000), 3, 'Tuesday', 45, 11, 2018, 1),
 (datetime.time(4, 56, 11, 796000), 4, 'Tuesday', 45, 11, 2018, 1),
 (datetime.time(4, 56, 38, 796000), 4, 'Tuesday', 45, 11, 2018, 1)]

In [13]:
%sql SELECT songs.song_id, songs.artist_id, songs.duration FROM songs LEFT JOIN songplays ON songs.song_id = songplays.song_id;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOBLGCN12AB0183212', 'AR47JEX1187B995D81', 125)]

In [7]:
%sql SELECT * from artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR47JEX1187B995D81', 'SUE THOMPSON', 'Nevada, MO', 37.8372, -94.3587)]

In [9]:
%sql select * from songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOBLGCN12AB0183212', 'James (Hold The Ladder Steady)', 'AR47JEX1187B995D81', 1985, 125)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).